import operator as оператор

from операции.база import Оп
from константы import ПИТОН_ОПКОДЫ, КОДЫ_ДВОИЧН_ОП
from типы import Стэк, ТаблицаИмен, КонстПул, Нуль


class Вернуть(Оп):
    """
    RESUME x
    """

    def __init__(сам, знач: int):
        сам.знач = знач

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        # TODO
        pass

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["RESUME"], сам.знач])


class ТолкнутьНуль(Оп):
    """
    PUSH_NULL
    """

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        стэк.append(Нуль())

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["PUSH_NULL"], 0])


class ЗагрКонст(Оп):
    """
    LOAD_CONST x
    """

    def __init__(сам, инд: int):
        сам.инд = инд

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        знач = конст_пул[сам.инд]
        стэк.append(знач)

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["LOAD_CONST"], сам.инд])


class ЗагрИмя(Оп):
    """
    LOAD_NAME x
    """

    def __init__(сам, инд: int):
        сам.инд = инд

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        знач = таблица_имен[сам.инд][1]
        стэк.append(знач)

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["LOAD_NAME"], сам.инд])


class СохрКакИмя(Оп):
    """
    STORE_NAME x
    """

    def __init__(сам, инд: int):
        сам.инд = инд

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        знач = стэк.pop()
        имя = таблица_имен[сам.инд][0]
        таблица_имен[сам.инд] = (имя, знач)

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["STORE_NAME"], сам.инд])


class ДвоичнОп(Оп):
    """
    BINARY_OP x
    """

    _КОД_К_ОПЕРАЦИИ = {
        КОДЫ_ДВОИЧН_ОП["СЛОЖЕНИЕ"]: оператор.add,
        КОДЫ_ДВОИЧН_ОП["И"]: оператор.and_,
        КОДЫ_ДВОИЧН_ОП["ЦЕЛОЕ_ДЕЛЕНИЕ"]: оператор.floordiv,
        КОДЫ_ДВОИЧН_ОП["ЛСДВИГ"]: оператор.lshift,
        КОДЫ_ДВОИЧН_ОП["МАТРИЧН_УМНОЖЕНИЕ"]: оператор.matmul,
        КОДЫ_ДВОИЧН_ОП["УМНОЖЕНИЕ"]: оператор.mul,
        КОДЫ_ДВОИЧН_ОП["ИЛИ"]: оператор.mod,
        КОДЫ_ДВОИЧН_ОП["ВЗЯТИЕ_ОСТАТКА"]: оператор.or_,
        КОДЫ_ДВОИЧН_ОП["СТЕПЕНЬ"]: оператор.pow,
        КОДЫ_ДВОИЧН_ОП["ПСДВИГ"]: оператор.rshift,
        КОДЫ_ДВОИЧН_ОП["ВЫЧИТАНИЕ"]: оператор.sub,
    }

    def __init__(сам, код: int):
        сам.код = код

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        правый = стэк.pop()
        левый = стэк.pop()
        оп = ДвоичнОп._КОД_К_ОПЕРАЦИИ[сам.код]
        рез = оп(левый, правый)
        стэк.append(рез)

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["BINARY_OP"], сам.код, 0, 0])


class Вызвать(Оп):
    """
    CALL x
    """

    def __init__(сам, аргументов: int):
        сам.аргументов = аргументов

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        аргументы = [стэк.pop() for _ in range(сам.аргументов)]
        вызываемое = стэк.pop()
        объект = стэк.pop()
        if объект is Нуль():
            результат = вызываемое(*аргументы)
        else:
            # TODO: реализовать вызов методов
            raise NotImplementedError
        стэк.append(результат)

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["CALL"], сам.аргументов, 0, 0, 0, 0, 0, 0])


class ТянутьВерхушку(Оп):
    """
    POP_TOP
    """

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        стэк.pop()

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["POP_TOP"], 0])


class ВернутьКонст(Оп):
    """
    RETURN_CONST x
    """

    def __init__(сам, инд: int):
        сам.инд = инд

    def исполнить(сам, стэк: Стэк, таблица_имен: ТаблицаИмен, конст_пул: КонстПул):
        # TODO
        pass

    def компилировать(сам) -> bytes:
        return bytes([ПИТОН_ОПКОДЫ["RETURN_CONST"], сам.инд])

