from dataclasses import dataclass as классданных
from typing import Self as Сам

from казино.типы import Стэк, ТаблицаИмен, КонстПул

@классданных(slots=True)
class Интерпретатор:
    тек_инд_оп: int
    стэк: Стэк
    таблица_имен: ТаблицаИмен
    конст_пул: КонстПул

    @classmethod
    def новый(клс, программа: "Программа") -> Сам:
        return клс(
            тек_инд_оп=0,
            стэк=[],
            таблица_имен=программа.таблица_имен,
            конст_пул=программа.конст_пул,
        )

