ПИТОН_ОПКОДЫ = {
    "RESUME": 151,
    "POP_TOP": 1,
    "PUSH_NULL": 2,
    "BINARY_OP": 122,
    "RETURN_CONST": 121,
    "STORE_NAME": 90,
    "LOAD_CONST": 100,
    "LOAD_NAME": 101,
    "CALL": 171,
    "POP_JUMP_IF_FALSE": 114,
    "POP_JUMP_IF_TRUE": 115,
    "POP_JUMP_IF_NOT_NONE": 128,
    "POP_JUMP_IF_NONE": 129,
}
МАГИЧЕСКОЕ_ЧИСЛО_ПИТОНА = b"\xcb\r\r\n\x00\x00\x00\x00"
КОДЫ_ДВОИЧН_ОП = {
    "СЛОЖЕНИЕ": 0,
    "И": 1,
    "ЦЕЛОЕ_ДЕЛЕНИЕ": 2,
    "ЛСДВИГ": 3,
    "МАТРИЧН_УМНОЖЕНИЕ": 4,
    "УМНОЖЕНИЕ": 5,
    "ИЛИ": 6,
    "ВЗЯТИЕ_ОСТАТКА": 7,
    "СТЕПЕНЬ": 8,
    "ПСДВИГ": 9,
    "ВЫЧИТАНИЕ": 10,
}
КЛЮЧЕВЫЕ_СЛОВА = {
    "да",
    "не",
    "посмотрите",
    "щит",
    "заряжаем",
    "как_в_казино",
    "ты_что_дурак",
    "чешем",
}
